Thank you for digging into that. So cloud formation registry would have to be updated. I've never used the awscc provider before, is it normal to have diff issues like this? I changed nothing in the configuration on this resource, but the provider is picking up many changes that are forcing replacement. Am I doing something wrong or is this a bug with this particular resource?

```
❯ terraform plan
awscc_ec2_network_insights_path.test: Refreshing state... [id=nip-1111111111111111]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # awscc_ec2_network_insights_path.test must be replaced
-/+ resource "awscc_ec2_network_insights_path" "test" {
      ~ created_date              = "2024-02-22T02:19:34.584Z" -> (known after apply)
      + destination               = (known after apply) # forces replacement
      + destination_arn           = (known after apply)
      + destination_ip            = (known after apply) # forces replacement
      + destination_port          = (known after apply) # forces replacement
      + filter_at_destination     = (known after apply) # forces replacement
      ~ filter_at_source          = { # forces replacement
          ~ destination_address    = "192.168.1.1" -> "192.168.1.2"
          + destination_port_range = (known after apply)
          + source_address         = (known after apply)
          + source_port_range      = (known after apply)
        }
      ~ id                        = "nip-1111111111111111" -> (known after apply)
      ~ network_insights_path_arn = "arn:aws:ec2:us-east-1:111122223333:network-insights-path/nip-1111111111111111" -> (known after apply)
      ~ network_insights_path_id  = "nip-1111111111111111" -> (known after apply)
      ~ source                    = "i-0b5e55a5594b7f57f" -> "arn:aws:ec2:us-east-1:111122223333:instance/i-1111111111111111" # forces replacement
      ~ source_arn                = "arn:aws:ec2:us-east-1:111122223333:instance/i-1111111111111111" -> (known after apply)
      + source_ip                 = (known after apply) # forces replacement
      + tags                      = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```